# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

a = [1.1, 1.2, 3.1, 5, 6, 10.01]
x=0
for i in range(len(a)):
    if a[0]==0:
        x+=1
    a[i] = a[i] % 1
 
min_zn=a[x]
for j in a[x:]:
    if j < min_zn and j != 0:
        min_zn=j
        print(min_zn)

Result = round(max(a) - min_zn, 3)
print(f"Разница между остатком дробей {round(max(a),3)} и {round(min_zn,3)} = {Result}")


